{
  "format": "layers-model",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "batch_input_shape": [
              null,
              4
            ],
            "units": 16,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "units": 5,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            4,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            16,
            5
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            5
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}